TASK 5 FOR INTERNSHIP (DATA CLEANING AND PROCESSING)

Clean and preprocess internship application data by:

Handling missing values

Removing duplicates

Detecting and treating outliers

Standardizing fields

Exporting cleaned dataset

In [ ]:
#load libraries

In [3]:
import pandas as pd
import numpy as np

In [ ]:
#Load dataset

In [11]:
df = pd.read_csv('internship_applications_raw.csv')
df.head()

,Application_ID,Name,Age,Gender,City,Skills,CGPA,Applied_Date
0,1,Ali,22.0,Male,Karachi,"Excel, SQL",3.2,2025-01-01
1,2,Sara,21.0,Female,Lahore,"Python, Tableau",3.8,2025-01-02
2,3,Ahmed,23.0,Male,Islamabad,"SQL, Power BI",3.5,2025-01-03
3,4,Fatima,NaN,Female,Karachi,Excel,2.9,2025-01-04
4,5,Hassan,24.0,Male,Lahore,Python,NaN,2025-01-05

In [13]:
df.isnull().sum()

Application_ID    0
Name              1
Age               2
Gender            1
City              1
Skills            1
CGPA              2
Applied_Date      0
dtype: int64

In [ ]:
#Step 4: Handle Missing Values

In [15]:
df_clean = df.copy()

df_clean["Name"] = df_clean["Name"].fillna("Unknown")
df_clean["Age"] = df_clean["Age"].fillna(df_clean["Age"].median())
df_clean["Gender"] = df_clean["Gender"].fillna("Unknown")
df_clean["City"] = df_clean["City"].fillna("Not Provided")
df_clean["Skills"] = df_clean["Skills"].fillna("Not Mentioned")
df_clean["CGPA"] = df_clean["CGPA"].fillna(df_clean["CGPA"].mean())

df_clean.isnull().sum()

Application_ID    0
Name              0
Age               0
Gender            0
City              0
Skills            0
CGPA              0
Applied_Date      0
dtype: int64

In [ ]:
#Step 5: Check & Remove Duplicates

In [17]:
df_clean.duplicated().sum()

0

In [19]:
df_clean = df_clean.drop_duplicates()

In [21]:
#Step 6: Standardize Gender Values

In [23]:
df_clean["Gender"] = df_clean["Gender"].str.strip().str.capitalize()
df_clean["Gender"].unique()

array(['Male', 'Female', 'Unknown'], dtype=object)

In [25]:
#Step 7: Detect Outliers (Age & CGPA)

In [ ]:
#Age Outliers

In [27]:
age_outliers = df_clean[(df_clean["Age"] < 18) | (df_clean["Age"] > 40)]
age_outliers

,Application_ID,Name,Age,Gender,City,Skills,CGPA,Applied_Date
18,19,Bilal,100.0,Male,Lahore,"Python, SQL",4.8,2025-01-19

In [29]:
#CGPA Outliers

In [31]:
cgpa_outliers = df_clean[(df_clean["CGPA"] < 0) | (df_clean["CGPA"] > 4)]
cgpa_outliers

,Application_ID,Name,Age,Gender,City,Skills,CGPA,Applied_Date
18,19,Bilal,100.0,Male,Lahore,"Python, SQL",4.8,2025-01-19

In [33]:
#Step 8: Treat Outliers (Capping Method)

In [35]:
df_clean.loc[df_clean["Age"] > 40, "Age"] = 40
df_clean.loc[df_clean["Age"] < 18, "Age"] = 18

df_clean.loc[df_clean["CGPA"] > 4, "CGPA"] = 4.0
df_clean.loc[df_clean["CGPA"] < 0, "CGPA"] = 0

In [37]:
#Step 9: Structure Skills Column

In [39]:
#Skills List

#Skills Count

In [41]:
df_clean["Skills_List"] = df_clean["Skills"].apply(lambda x: [s.strip() for s in x.split(",")])
df_clean["Skills_Count"] = df_clean["Skills_List"].apply(len)

df_clean[["Name","Skills","Skills_List","Skills_Count"]].head()

     Name           Skills        Skills_List  Skills_Count
0     Ali       Excel, SQL       [Excel, SQL]             2
1    Sara  Python, Tableau  [Python, Tableau]             2
2   Ahmed    SQL, Power BI    [SQL, Power BI]             2
3  Fatima            Excel            [Excel]             1
4  Hassan           Python           [Python]             1

In [43]:
#Step 10: Export Clean Dataset

In [49]:
df_clean.to_csv("internship_applications_clean.csv", index=False)
print("Clean dataset exported successfully")

Clean dataset exported successfully

Final Output (What you achieved)

 Data cleaned
 
 Missing values handled
 
 Outliers fixed
 
 Gender standardized
 
 Skills structured
 
 Final clean dataset exported for analysis/dashboard

THANK YOU